src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Уникальный идентификатор пользователя информационной базы</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходВПрограммуРазрешен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Роли</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтображатьОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <predefined>
    <items>
      <name>Закупочная</name>
      <description>Prix d'achat</description>
    </items>
    <items>
      <name>Розничная</name>
      <description>Prix de vente</description>
    </items>
    <items>
      <name>МинимальнаяЦенаПродажи</name>
      <description>Prix minimal</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическийРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсноваРасчёта</name>
    <type>
      <types>EnumRef.ОсновыРасчётаНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНаценки</name>
    <type>
      <types>EnumRef.ВидыНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Documents/ЗаказПокупателя/Forms/ФормаДокументаECommerce/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	ДСОбсуждение.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	УстановитьВидЦеныПоДоговору();	
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	Если Объект.Ссылка.Пустая() Тогда
		Если Параметры.Свойство("ECommerce") Тогда 
			Объект.ECommerce = Параметры.ECommerce;
		КонецЕсли;
		Если Параметры.Свойство("Контрагент") Тогда 
			Объект.Контрагент = Параметры.Контрагент;
		КонецЕсли;
		Если Параметры.Свойство("Комментарий") Тогда 
			Объект.Комментарий = Параметры.Комментарий;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)	
    РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = РаботаСДокументамиКлиент.КлиентуЗапрещеноОтгружать(Объект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ДатаОтгрузкиПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	УстановитьЦеныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	//УстановитьЦеныНаСервере();
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Истина);
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
		ТекСтр.ВидЦены = ВидЦены;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РаботаСДокументамиКлиент.ПроверитьКратностьЕдиницы(Элемент.ТекущиеДанные, Объект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриАктивизацииЯчейки(Элемент)
	ТекСтр = Элемент.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
	Если Элемент.ТекущийЭлемент = Элементы.ТЧТоварыЦена Или Элемент.ТекущийЭлемент = Элементы.ТЧТоварыСумма Тогда
		Элемент.ТекущийЭлемент.ТолькоПросмотр = ЗначениеЗаполнено(ТекСтр.ВидЦены);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыВидЦеныПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);	
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПроцентСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ДСОбсуждениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма);
	РаботаСДокументамиКлиент.ДобавитьКомментарий(Объект.Ссылка, ПолучитьАдресатаОбсуждения());
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦены(Команда)
	УстановитьЦеныНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно
	
&НаСервере
Процедура УстановитьЦеныНаСервере()
	РаботаСДокументами.УстановитьЦеныВТабличнойЧасти(Объект.ТЧТовары, ВидЦены, Объект.ДатаОтгрузки);		
КонецПроцедуры 

&НаСервере
Функция ПолучитьАдресатаОбсуждения()
	УстановитьПривилегированныйРежим(Истина);
	Возврат Справочники.Пользователи.ПолучитьПоСотруднику(Объект.Менеджер);	
КонецФункции	

&НаСервере
Процедура УстановитьВидЦеныПоДоговору()
	//ВидЦены = ?(ЗначениеЗаполнено(Объект.Договор.ВидЦены),Объект.Договор.ВидЦены, Справочники.ВидыЦен.Розничная);
	ВидЦены = ?(ЗначениеЗаполнено(Объект.Контрагент.ТипЦены),Объект.Контрагент.ТипЦены, Справочники.ВидыЦен.Розничная);
	РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыАвтоподбора = РаботаСДокументамиКлиент.ПараметрыАвтободбораНоменклатуры();
	ПараметрыАвтоподбора.ВидЦены = ВидЦены;
	ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования = Истина;
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка, ПараметрыАвтоподбора);
КонецПроцедуры

#КонецОбласти
